from random import choice
answers = ["Бесспорно", "Мне кажется - да", "Пока неясно, попробуй снова", "Даже не думай",
            "Предрешено", "Вероятнее всего", "Спроси позже", "Мой ответ - нет",
            "Никаких сомнений", "Хорошие перспективы", "Лучше не рассказывать", "По моим данным - нет",
            "Можешь быть уверен в этом", "Да", "Сконцентрируйся и спроси опять", "Весьма сомнительно"]
print('Привет Мир, я магический шар, и я знаю ответ на любой твой вопрос.', "Как вас зовут?")
name = input()
print("Привет,", name)
an = 'да'
while an.lower() == "да":
    question = input("Задай мне вопрос\n")
    print(choice(answers))
    repeat = input("Задать еще вопрос? (да = д; нет = н)")
    if an.lower() != 'да':
        print("'Возвращайся если возникнут вопросы!'")
